<?php 
//Московская область: Москва, Зеленоград, Клин Ленинградская область: Санкт-Петербург, Всеволожск, Павловск, Кронштадт
//Свердловская область: Екатеринбург, Ревда, Первоуральск, Серов, Реж

$Cities = array (
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Свердловская область' => ['Екатеринбург', 'Ревда', 'Первоуральск', 'Серов', 'Реж']
);

//var_dump($Cities);

foreach($Cities as $key => $towns) {
    echo $key.': ';
    foreach($towns as $town) {
        echo $town.', ';
    }

}

